package com.sist.crawler;

public enum Category {

    // 텐트         //카테고리 참조 외래키
    CODE_202(202, 2),
    CODE_203(203, 3),
    CODE_204(204, 4),
    CODE_207(207, 5),
    CODE_209(209, 6),
    CODE_215(215, 7),
    CODE_261(261, 8),
    CODE_276(276, 9),

    // 타프/쉘터
    CODE_211(211, 11),
    CODE_212(212, 12),
    CODE_217(217, 13),
    CODE_224(224, 14),

    // 폴대/펙/스트링
    CODE_218(218, 16),
    CODE_219(219, 17),
    CODE_220(220, 18),

    // 테이블/체어
    CODE_99(99, 20),
    CODE_68(68, 21),
    CODE_71(71, 22),
    CODE_69(69, 23),
    CODE_284(284, 24),
    CODE_283(283, 25),
    CODE_70(70, 26),
    CODE_285(285, 27),
    CODE_72(72, 28),

    // 베드/침구/매트
    CODE_66(66, 30),
    CODE_63(63, 31),
    CODE_190(190, 32),
    CODE_67(67, 33),
    CODE_65(65, 34),
    CODE_64(64, 35),
    CODE_299(299, 36),

    // 스토브/랜턴
    CODE_138(138, 38),
    CODE_83(83, 39),
    CODE_84(84, 40),
    CODE_85(85, 41),
    CODE_86(86, 42),
    CODE_303(303, 43),
    CODE_186(186, 44),

    // 식기/쿠커
    CODE_73(73, 46),
    CODE_74(74, 47),
    CODE_301(301, 48),
    CODE_82(82, 49),
    CODE_75(75, 50),
    CODE_78(78, 51),
    CODE_80(80, 52),
    CODE_300(300, 53),
    CODE_191(191, 54),
    CODE_315(315, 55),
    CODE_81(81, 56),

    // 화로/BBQ
    CODE_87(87, 58),
    CODE_298(298, 59),
    CODE_88(88, 60),
    CODE_89(89, 61),
    CODE_296(296, 62),
    CODE_297(297, 63),
    CODE_90(90, 64),
    CODE_91(91, 65),

    // 냉방/난방
    CODE_189(189, 67),
    CODE_178(178, 68),
    CODE_179(179, 69),
    CODE_180(180, 70),
    CODE_269(269, 71),
    CODE_264(264, 72),
    CODE_181(181, 73),

    // 수납/케이스
    CODE_295(295, 75),
    CODE_286(286, 76),
    CODE_292(292, 77),
    CODE_293(294, 78),
    CODE_290(290, 79),
    CODE_291(291, 80),
    CODE_94(94, 81),
    CODE_294(294, 82),
    CODE_137(137, 83),
    CODE_287(287, 84),
    CODE_289(289, 85),

    // 나이프/공구/위생
    CODE_246(246, 87),
    CODE_93(93, 88),
    CODE_248(248, 89),
    CODE_187(187, 90),
    CODE_192(192, 91),
    CODE_247(247, 92),
    CODE_350(350, 93),
    CODE_95(95, 94),
    CODE_302(302, 95),
    CODE_96(96, 96),

    // 배당/디팩/모자
    CODE_270(270, 98),
    CODE_271(271, 99),
    CODE_272(272, 100),
    CODE_274(274, 101),
    CODE_288(288, 102),
    CODE_273(273, 103),
    CODE_275(275, 104),
    CODE_318(318, 105);


    private final int code;

    private final int cno;

    Category(int code, int cno) {
        this.code = code;
        this.cno = cno;
    }

    public int getCode() {
        return code;
    }

    public int getCno() {
        return cno;
    }

}
